Revit 2024 API
StructuralSectionGeneralW Constructor
 Creates a new instance of Angle shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralSectionGeneralW(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double flangeFillet,
	double topWebFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Visual Basic
Public Sub New ( _
	width As Double, _
	height As Double, _
	flangeThickness As Double, _
	webThickness As Double, _
	webFillet As Double, _
	flangeFillet As Double, _
	topWebFillet As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	analysisParams As StructuralSectionAnalysisParams _
)
Visual C++
public:
StructuralSectionGeneralW(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double flangeFillet,
	double topWebFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
Parameters
width
Type: System.Double
 Section width.
height
Type: System.Double
 Section height, depth.
flangeThickness
Type: System.Double
 Flange Thickness.
webThickness
Type: System.Double
 Web Thickness.
webFillet
Type: System.Double
 Web Fillet - fillet radius between web and flange.
flangeFillet
Type: System.Double
 Flange Fillet - fillet radius at the flange end.
topWebFillet
Type: System.Double
 Top Web Fillet - fillet radius at the top of web.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
StructuralSectionGeneralW Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace